[
  {
    "idLibro": 2,
    "codigoLibro": "BM000002",
    "tituloLibro": "Industria 4.0 La cuarta revolución industrial",
    "formatoLibro": "a",
    "resumenLibro": "El término Industria 4.0 se acuñó en Alemania en el año 2011 en la Feria tecnológica de Hannover-Messe, si bien fue en la edición de dicha feria en 2013 cuando se presentó la Iniciativa oficial del Gobierno de Alemania. El documento fundacional de Industria 4.0 y de la plataforma asociada (Platform Industrie 4.0) denominado Recommendations for implementig the strategic initiative Industrie 4.0 fue redactado por Acatech (Academia Nacional de Ciencia e Ingeniería de Alemania) y presentado en abril de 2013. Contó con la colaboración del DFKI (Centro de Investigación alemán para la Inteligencia Artificial) así como el apoyo de la industria y grandes empresas alemanas. Industria 4.0 describe la digitalización de sistemas y procesos industriales, y su interconexión mediante la Internet de las cosas e Internet de los Servicios para conseguir una mayor flexibilidad e individualización de los procesos productivos. Es una visión de la fábrica del futuro o fábrica inteligente. La transformación digital de la industria y las empresas con la integración de las nuevas tecnologías disruptivas, el citado Internet de las Cosas, Big Data, la Nube (Cloud Computing) y la Ciberseguridad, todo ello enmarcado en las Ciudades Inteligentes (Smart Cities) está produciendo el advenimiento y despliegue de la Cuarta Revolución Industrial.",
    "ISBNLibro": "978-84-267-25",
    "anioPublicacionLibro": 2017,
    "fechaCreacionLibro": "2020-06-18T11:24:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 5,
    "codigoLibro": "BM000005",
    "tituloLibro": "BIG DATA ANALISIS DE GRANDES VOLUMENES DE DATOS EN ORGANIZACIONES",
    "formatoLibro": "a",
    "resumenLibro": "Big Data (grandes volúmenes de datos o macrodatos) supone la confluencia de una multitud de tendencias tecnológicas que venían madurando desde la primera década del siglo cuando han explosionado e irrumpido con gran fuerza en organizaciones y empresas, en particular, y en la sociedad, en general. Muchas veces estos datos no están estructurados, esta tecnología viene a iluminarlos. El libro se divide en 3 partes principales, se introduce el tema, se descubre la infraestructura y la analítica del Big Data. Tiene en sus manos la referencia necesaria para introducirse en Big Data. Aprenda: ¿Qué es Big Data? Analítica de datos, analítica Web y analítica social. Sectores estratégicos de Big Data y Open Data. Conozca: Las mejores herramientas informáticas para procesar sus datos. Las nuevas tendencias tecnológicas y sociales que traen la nube y los Big Data.",
    "ISBNLibro": "978-84-267-20",
    "anioPublicacionLibro": 2013,
    "fechaCreacionLibro": "2020-06-25T12:33:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 6,
    "codigoLibro": "BM000006",
    "tituloLibro": "FUNDAMENTOS GENERALES DE PROGRAMACION",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-607-15-08",
    "anioPublicacionLibro": 2013,
    "fechaCreacionLibro": "2020-06-25T13:26:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 8,
    "codigoLibro": "BM00000",
    "tituloLibro": "Programación orientada a objetos",
    "formatoLibro": "i",
    "resumenLibro": "La segunda edición de Programación orientada a objetos ha reunido la experiencia del autor, contenida en la primera edición, con el enfoque del nuevo estándar ANSI/ISO C++, así como la biblioteca de plantillas (templates) estándar STL, etc.",
    "ISBNLibro": "978-84-481-20",
    "anioPublicacionLibro": 1998,
    "fechaCreacionLibro": "2020-06-26T05:15:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 62,
    "codigoLibro": "BM000060",
    "tituloLibro": "Ingeniería interior Guía yogui para alcanzar la alegría y el gozo",
    "formatoLibro": "a",
    "resumenLibro": "Sadhguru —visionario, místico y yogui— presenta la ciencia clásica del yoga a los lectores occidentales. Esta disciplina, tal y como Sadhguru la expone, es un medio para que creemos situaciones internas exactamente tal y como las queremos, convirtiéndonos así en los arquitectos de nuestra propia alegría.",
    "ISBNLibro": "978-84-8445-743-5",
    "anioPublicacionLibro": 2018,
    "fechaCreacionLibro": "2020-07-08T17:09:30.397203-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 20,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 60,
    "codigoLibro": "BM000057",
    "tituloLibro": "Academia de ingeniería ROBÓTICA",
    "formatoLibro": "e",
    "resumenLibro": "Libro de ingeniería robótica interactivo. Libro caja que contiene piezas extraíbles, jeringas, cuerda, tubos, etc. para poder seguir las actividades que propone el libro y crear pequeños robots. El libro expone de forma clara, visual y muy lúdica conceptos relacionados con el mundo de la ingeniería robótica: sensores, hidráulica, drones, programas informáticos, etc. Explica además todos los avances que existen hoy en día sobre el tema. Al final del libro, un vocabulario con los términos más técnicos utilizados en el libro.",
    "ISBNLibro": "978-84-683-4081-4",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-07-08T16:55:59.897638-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 18,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 9,
    "codigoLibro": "BM000008",
    "tituloLibro": "Problemas de metodología de la programación",
    "formatoLibro": "i",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-7615-4",
    "anioPublicacionLibro": 2018,
    "fechaCreacionLibro": "2020-06-26T05:17:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 10,
    "codigoLibro": "BM00000",
    "tituloLibro": "Programación en C++. Algoritmos, estructuras de datos y objetos",
    "formatoLibro": "i",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-92623-05-1",
    "anioPublicacionLibro": 2006,
    "fechaCreacionLibro": "2020-06-26T05:21:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 11,
    "codigoLibro": "BM000009",
    "tituloLibro": "Fundamentos de empresa 2.0 estrategias en la web 2.0",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-92623-",
    "anioPublicacionLibro": 2009,
    "fechaCreacionLibro": "2020-06-26T05:33:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 12,
    "codigoLibro": "BM000010",
    "tituloLibro": "INFORMATICA GLOSARIO",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-968-451-758-5",
    "anioPublicacionLibro": 2016,
    "fechaCreacionLibro": "2020-06-26T05:38:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 13,
    "codigoLibro": "BM000011",
    "tituloLibro": "Borland C++ 4/4.5",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-481-0279-1",
    "anioPublicacionLibro": 1995,
    "fechaCreacionLibro": "2020-06-26T05:40:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 14,
    "codigoLibro": "BM000012",
    "tituloLibro": "PROGRAMACIÓN BASIC PARA MICROCOMPUTADORAS",
    "formatoLibro": "i",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-7615-127-3",
    "anioPublicacionLibro": 1986,
    "fechaCreacionLibro": "2020-06-26T05:44:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 15,
    "codigoLibro": "BM000013",
    "tituloLibro": "Fundamentos de programación ALGORITMOS, ESTRUCTURAS DE DATOS Y OBJETOS",
    "formatoLibro": "i",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-481-3664-2",
    "anioPublicacionLibro": 2003,
    "fechaCreacionLibro": "2020-06-26T05:47:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 16,
    "codigoLibro": "BM00000",
    "tituloLibro": "C++ a su alcance",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-481-1991-1",
    "anioPublicacionLibro": 1994,
    "fechaCreacionLibro": "2020-06-26T05:48:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 17,
    "codigoLibro": "BM00000",
    "tituloLibro": "Borland C++",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-481-0129-9",
    "anioPublicacionLibro": 1993,
    "fechaCreacionLibro": "2020-06-26T05:52:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 18,
    "codigoLibro": "BM000014",
    "tituloLibro": "Programación en QuickBasic, QBasic",
    "formatoLibro": "a",
    "resumenLibro": "No Disponilble",
    "ISBNLibro": "978-84-481-1887-7",
    "anioPublicacionLibro": 1994,
    "fechaCreacionLibro": "2020-06-26T06:02:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 20,
    "codigoLibro": "BM000016",
    "tituloLibro": "Quick Basic avanzado 4.5",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-931-6",
    "anioPublicacionLibro": 1992,
    "fechaCreacionLibro": "2020-07-08T05:44:00.178997-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 19,
    "codigoLibro": "BM000015",
    "tituloLibro": "Turbo Pascal 5.0-5.5",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-596-7",
    "anioPublicacionLibro": 1990,
    "fechaCreacionLibro": "2020-07-07T09:25:40.400714-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 36,
    "codigoLibro": "BM000035",
    "tituloLibro": "PROGRAMACION EN C/C++JAVA Y UML",
    "formatoLibro": "i",
    "resumenLibro": "En este texto se abordan los tres lenguajes de programación, primero independientemente, Lugo interrelacionados y después en paralelo, de modo que el profesor pueda elegir el orden, la secuencia, el lenguaje o los lenguajes, en la forma que mejor se adapte a su clase, por lo que el libro pretende enseñar a programar una computadora utilizando varios lenguajes de programación estándares &#x02013;C,C+ y Java &#x02013;lenguaje de modelado de sistemas UML, así como introducir al lector ene l fundamental campo de las estructuras de datos Este es un libro diseñado para aprender a programar utilizando cualquier lenguaje de programación y no exclusivamente C/C++ o Java. No obstante, confiamos en que los estudiantes y autodidactas que utilicen la obra puedan conocer los tres lenguajes de programación y los el lenguaje unificado UML, de modo que puedan aprender y conocer profesionalmente, tanto las técnicas clásicas y avanzadas de programación estructurada, como las técnicas orientadas a objetos y, el diseño y construcción de estructura de datos.",
    "ISBNLibro": "978-970-10-6949-3",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-07-08T11:53:58.157061-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 7,
    "codigoLibro": "BM000007",
    "tituloLibro": "Programación en C++. Serie Schaum",
    "formatoLibro": "a",
    "resumenLibro": "Prólogo. 1. Programación orientada a objetos versus programación estructurada: C++ y algoritmos. 2. Conceptos básicos de los programas en C++. 3. Operadores y expresiones. 4. Estructuras de control selectivas. 5. Estructuras de control repetitivas. 6. Funciones y módulos. 7. Arrays (arreglos, listas o tablas). 8. Registros (estructuras y uniones. 9. Cadenas. 10. Punteros (apuntadores). 11. Gestión dinámica de la memoria. 12. Ordenación y búsqueda. 13 Clases y objetos. 14. Herenciay polimorfismo. 15. Plantillas, excepciones y sobrecarga de operadores. 16. Flujos y archivos. 17. Listas enlazadas. 18. Pilas y colas. 19. Recursividad. 20. Árboles. Índice.",
    "ISBNLibro": "978-84-481-46",
    "anioPublicacionLibro": 2006,
    "fechaCreacionLibro": "2020-06-26T04:51:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 3,
    "codigoLibro": "BM000003",
    "tituloLibro": "Sistemas de Información en la Empresa",
    "formatoLibro": "e",
    "resumenLibro": "Este libro fue escrito como un 'libro de texto' para carreras universitarias y de formación profesional y, a la vez, como un 'libro de lectura y consulta' pensando en autodidactas y profesionales que desean introducirse en el campo de los sistemas de información. Además, la obra está inspirada en los pilares existentes y futuros de la actual era de la información que consta de cuatro pilares: cloud computing, información (Big Data), movilidad y medios sociales (social media). A lo que se les ha unido con gran intensidad en estos dos últimos años la fuerza o tendencia del Internet de las cosas (IoT) o Internet de todas las cosas (Internet of everything). Su objetivo principal es analizar y describir el rol de los sistemas de información que ayudan de modo muy notable a los administradores (gerentes) y directivos en la toma de decisiones en las organizaciones y empresas. Se han tratado los actuales sistemas de información y, además, enunciado los del futuro soportados en las tecnologías de la información como cualquier otro recurso estratégico organizacional. Un activo que los gerentes, administradores y directivos necesitan utilizar y entender para ser los más eficientes posible en su quehacer diario y capacitarse para planear, seleccionar y administrar del modo más rentable sus organizaciones creando el valor óptimo adecuado a las mismas.",
    "ISBNLibro": "978-84-267-22",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-06-18T11:36:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 4,
    "codigoLibro": "BM000003",
    "tituloLibro": "Computación en la nube: estrategias de Cloud Computing en las empresas",
    "formatoLibro": "a",
    "resumenLibro": "Ésta obra expone de manera clara el modelo de la computación en nube (Cloud Computing) mediante la descripción de sus arquitecturas y modelos más sobresalientes. La nube es la plataforma tecnológica por excelencia de la década actual y, posiblemente, del futuro de la computación y se ha convertido en el término de moda de todos los medios de comunicación a nivel mundial. Con la computación en nube todo lo que hace en su computadora ahora estará en la Web y podrá acceder a sus programas y documentos desde cualquier lugar en cualquier PC conectada a Internet. Conozca Las ventajas de la Nube para organizaciones y empresas como un método de ahorro de costos y aumento de la productividad, a la vez que potencia el rendimiento y desempeño de las herramientas y personas de las organizaciones.La gran cantidad de datos prácticos y de actualidad, así como la exposición de los proveedores y soluciones más populares tales como Google, Amazon, Salesforce, IBM, Dell o Microsoft. Aprenda Lo que debe hacer su organización en la nube, como migrar a ella y como afrontar este nuevo paradigma tecnológico de gran impacto social en los próximos años. Sobre uno de los términos (buzzwords) más impactantes en ambientes tecnológicos y de negocios en los últimos años, un nuevo estilo de computación que se asienta en varios pilares: Web 2.0, SaaS (Software como Servicio), HaaS (Hardware como Servicio), PaS (Plataforma como Servicio), Virtualización y Almacenamiento. Realice La óptima utilización de las directrices y estrategias -independientemente de su formación y profesión de la nube, la cual está propiciando una nueva revolución industrial soportada en las nuevas fábricas de 'datos' (Data Centers) y de 'aplicaciones Web' (Web Apps).",
    "ISBNLibro": "978-84-267-18",
    "anioPublicacionLibro": 2012,
    "fechaCreacionLibro": "2020-06-23T12:29:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 61,
    "codigoLibro": "BM000058",
    "tituloLibro": "ACADEMIA DE INGENIERÍA: EL ESPACIO",
    "formatoLibro": "a",
    "resumenLibro": "Libro interactivo sobre ingeniería espacial. Libro caja que contiene piezas extraíbles, tuercas y tornillos de plástico para crear una nave espacial, un visor de constelaciones, y otras herramientas para conocer a fondo el mundo espacial. El libro expone de forma clara, visual y muy lúdica conceptos relacionados con el mundo de la ingeniería espacial: gravedad, velocidad orbital, etc. Explica además todos los avances que existen hoy en día sobre el tema. Al final del libro, un vocabulario con los términos más técnicos utilizados en el libro.",
    "ISBNLibro": "978-84-683-4322-8",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-07-08T17:02:05.319037-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 18,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 63,
    "codigoLibro": "BM000062",
    "tituloLibro": "Ingeniería para bebés",
    "formatoLibro": "a",
    "resumenLibro": "¿Ingeniería para bebés? Pues sí: los más pequeños de la casa también pueden entender cómo funciona el mundo con los libros de esta colección que les explican, de manera muy muy sencilla, temas como la ingeniería, la economía o la zoología. Con estos libros, ¡comprender es muy fácil!",
    "ISBNLibro": "978-84-677-7183-1",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T17:17:02.723056-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 21,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 1,
    "codigoLibro": "BM000001",
    "tituloLibro": "Inteligencia de negocios y analítica de datos",
    "formatoLibro": "i",
    "resumenLibro": "El término Inteligencia de Negocios (Business Intelligence) ?con frecuencia, también se utiliza el término Inteligencia de Negocio (en singular) ? fue acuñado por Gartner a mitad de la década de los 90, aunque el concepto tiene su origen en el comienzo de los sistemas de información gerenciales (MIS, Management Information System) de los años 70, cuando comenzaba la automatización de las tareas en las empresas. Hoy en día los sistemas de información son la espina dorsal de las empresas y su soporte diario y el eje sobre el que se vertebran los sistemas de Inteligencia de Negocios. El libro hace una introducción teórico-práctica a la Inteligencia de Negocios y a la Analítica de Negocios, extendida a la Analítica de Datos y sus diferentes categorías, así como a la Analítica de Big Data, dada la expansión de esta tendencia tecnológica en todo tipo de organizaciones y empresas, además de en los mundos académicos y de investigación. Se da respuesta a las preguntas más utilizadas en la gestión empresarial y en los campos de la educación y de la investigación. Se describe el panorama general del empleo y tendencias de esta tecnología con estadísticas e información muy actualizada. CONOZCA Inteligencia de negocios Analítica de negocios Empresas líderes en el mundo Productos disponibles Tendencias actuales APRENDA A buscar y elegir las mejores soluciones para su empresa. REALICE Comparaciones entre diferentes productos y estrategias para decidir lo mejor para su empresa.",
    "ISBNLibro": "978-84-267-27",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-06-18T10:47:00-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 21,
    "codigoLibro": "BM000020",
    "tituloLibro": "Redes sociales la nueva revolución de la era Facebook",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-92623-07-5",
    "anioPublicacionLibro": 1900,
    "fechaCreacionLibro": "2020-07-08T10:47:10.449654-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 32,
    "codigoLibro": "BM000031",
    "tituloLibro": "BL C. ALGORITMOS. PROGRAMACION Y ESTRUCTURA DE DATOS. SERIE SCHAUM. LIBRO DIGITAL",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-486-0827-9",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-07-08T11:44:55.307527-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 23,
    "codigoLibro": "BM000022",
    "tituloLibro": "Turbo PASCAL 6.0 a su alcance",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-92623-07-5",
    "anioPublicacionLibro": 1900,
    "fechaCreacionLibro": "2020-07-08T11:09:12.836342-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 22,
    "codigoLibro": "BM000021",
    "tituloLibro": "Microsoft c-c ++ 7.0",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-92623-07-5",
    "anioPublicacionLibro": 1994,
    "fechaCreacionLibro": "2020-07-08T10:56:47.563001-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 24,
    "codigoLibro": "BM000023",
    "tituloLibro": "Programación en Fortran",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-604-5519-6",
    "anioPublicacionLibro": 1993,
    "fechaCreacionLibro": "2020-07-08T11:17:13.434995-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 25,
    "codigoLibro": "BM000024",
    "tituloLibro": "Programación en Fortran versiones Fortran 77 y Fortran 90",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-604-5519-6",
    "anioPublicacionLibro": 1993,
    "fechaCreacionLibro": "2020-07-08T11:19:45.271344-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 26,
    "codigoLibro": "BM000025",
    "tituloLibro": "Turbo C++",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-821-0",
    "anioPublicacionLibro": 1992,
    "fechaCreacionLibro": "2020-07-08T11:22:54.179661-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 27,
    "codigoLibro": "BM000026",
    "tituloLibro": "C # manual de programación",
    "formatoLibro": "a",
    "resumenLibro": "Este libro es una obra diseñada para el aprendizaje de la programación en C# con las técnicas de programación estructurada y orientada a objetos, que considera cómo escribir aplicaciones tanto de consola como de esritorio con Windows Forms. También explica los fundamentos de C#, conceptos generales de programación orientada a objetos, estructuras de control, tratamiento de excepciones, manejo de eventos, gestión de archivos y conceptos avanzados de hilos.",
    "ISBNLibro": "978-84-481-3624-6",
    "anioPublicacionLibro": 2002,
    "fechaCreacionLibro": "2020-07-08T11:25:04.367765-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 28,
    "codigoLibro": "BM000027",
    "tituloLibro": "PROGRAMACION EN JAVA 6 ALGORITMOS PROGRAMACION ORIENTADA",
    "formatoLibro": "a",
    "resumenLibro": "Índice\r\n\r\n1. Introducción a la programación. 2. Metodología de programación, creación y desarrollo de programas en Java.  3. Elementos básicos de Java.  4. Operadores y expresiones.  5. Estructuras de selección  6. Estructuras de control I: bucles (lazos).  7. Fundamentos de programación orientada a objetos y UML.  8. Clases y objetos.  9. Métodos. 10. Arreglos (arrays).  11. Cadenas.  12. Extensión de clases: interfaces, clases internas y enumeraciones.  13. Herencia.  14. Polimorfismo.  15. Genericidad.  16. Excepciones.  17. Archivos y flujos.  18. Algoritmos de ordenación y búsqueda.  19. Recursividad.  20. Gráficos I. GUI/Swing.  21. Gráficos II. Componentes y eventos.  22. Applets: programación en Internet.",
    "ISBNLibro": "978-607-15-0618-4",
    "anioPublicacionLibro": 2011,
    "fechaCreacionLibro": "2020-07-08T11:30:28.038491-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 33,
    "codigoLibro": "BM000032",
    "tituloLibro": "Algoritmos y estructuras de datos una perspectiva en C",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-481-9270-9",
    "anioPublicacionLibro": 2014,
    "fechaCreacionLibro": "2020-07-08T11:47:23.439287-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 29,
    "codigoLibro": "BM000028",
    "tituloLibro": "PIBM PC. Manual de Basic (Versión Basic y Basica del PC, XT y AT)",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-124-2",
    "anioPublicacionLibro": 1986,
    "fechaCreacionLibro": "2020-07-08T11:36:17.118452-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 30,
    "codigoLibro": "BM000029",
    "tituloLibro": "Programación en Turbo Pascal 4.0-5.5",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-449-6",
    "anioPublicacionLibro": 1989,
    "fechaCreacionLibro": "2020-07-08T11:38:49.17902-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 31,
    "codigoLibro": "BM000030",
    "tituloLibro": "C ++",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-481-0017-9",
    "anioPublicacionLibro": 1992,
    "fechaCreacionLibro": "2020-07-08T11:41:44.038175-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 34,
    "codigoLibro": "BM000033",
    "tituloLibro": "Curso de programación con Turbo C++",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-481-0278-4",
    "anioPublicacionLibro": 1995,
    "fechaCreacionLibro": "2020-07-08T11:49:28.266362-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 35,
    "codigoLibro": "BM000034",
    "tituloLibro": "Turbo Basic. Manual de programación",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-297-3",
    "anioPublicacionLibro": 1988,
    "fechaCreacionLibro": "2020-07-08T11:51:51.533105-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 37,
    "codigoLibro": "BM000036",
    "tituloLibro": "Fundamentos de programación. Libro de problemas",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-481-0700-0",
    "anioPublicacionLibro": 1996,
    "fechaCreacionLibro": "2020-07-08T11:56:55.538385-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 38,
    "codigoLibro": "BM000037",
    "tituloLibro": "Microsoft Visual C++ 1.5/2",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-481-0280-7",
    "anioPublicacionLibro": 1995,
    "fechaCreacionLibro": "2020-07-08T11:59:39.950586-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 39,
    "codigoLibro": "BM000038",
    "tituloLibro": "Programación en QuickBasic 4.0-4.5",
    "formatoLibro": "i",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-7615-384-0",
    "anioPublicacionLibro": 1989,
    "fechaCreacionLibro": "2020-07-08T12:03:54.7515-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 40,
    "codigoLibro": "BM000039",
    "tituloLibro": "Turbo Pascal 7.0",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-481-1755-9",
    "anioPublicacionLibro": 1994,
    "fechaCreacionLibro": "2020-07-08T12:05:38.727889-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 43,
    "codigoLibro": "BM000041",
    "tituloLibro": "ADMINISTRACION 8ª",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-970-26-0555-3",
    "anioPublicacionLibro": 2006,
    "fechaCreacionLibro": "2020-07-08T12:33:10.082899-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 41,
    "codigoLibro": "BM000040",
    "tituloLibro": "ADMINISTRACIÓN",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-607-32-4337-7",
    "anioPublicacionLibro": 2018,
    "fechaCreacionLibro": "2020-07-08T12:11:48.808633-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 42,
    "codigoLibro": "BM00000",
    "tituloLibro": "Fundamentos de administración",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-607-32-3962-2",
    "anioPublicacionLibro": 2017,
    "fechaCreacionLibro": "2020-07-08T12:23:28.763548-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 2,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 44,
    "codigoLibro": "BM00000",
    "tituloLibro": "ADMINISTRACIÓN Gestión organizacional, enfoques y proceso administrativo",
    "formatoLibro": "a",
    "resumenLibro": "Los gerentes son necesarios en cualquier organización sin importar su tamaño, tipo o ubicación. Debido a su importancia, este libro da las claves a los gerentes para desarrollar sus habilidades y enfrentar los retos que presenta este mundo cambiante.",
    "ISBNLibro": "978-607-442-388-4",
    "anioPublicacionLibro": 2011,
    "fechaCreacionLibro": "2020-07-08T12:36:01.943699-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 4,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 45,
    "codigoLibro": "BM000042",
    "tituloLibro": "MANAGEMENT (11 ED.2011)",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-0-273-75285-1",
    "anioPublicacionLibro": 2012,
    "fechaCreacionLibro": "2020-07-08T12:43:59.999172-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 5,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 46,
    "codigoLibro": "BM000043",
    "tituloLibro": "Fundamentals Of Management, Global Edition",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-1-292-05654-8",
    "anioPublicacionLibro": 2014,
    "fechaCreacionLibro": "2020-07-08T12:50:36.092787-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 6,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 47,
    "codigoLibro": "BM000044",
    "tituloLibro": "Management",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-0-13-121190-2",
    "anioPublicacionLibro": 2003,
    "fechaCreacionLibro": "2020-07-08T12:54:44.022186-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 7,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 48,
    "codigoLibro": "BM000045",
    "tituloLibro": "ADMINISTRACION 6ª ED.",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-970-17-0388-5",
    "anioPublicacionLibro": 2001,
    "fechaCreacionLibro": "2020-07-08T13:01:58.055772-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 4,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 58,
    "codigoLibro": "BM000055",
    "tituloLibro": "MIRA: SOY INGENIERA",
    "formatoLibro": "a",
    "resumenLibro": "MIRA SOY INGENIERA acerca la profesión ingeniero/a a niños y niñas a partir de 5 años. Y lo hace a través de actividades y divertidos experimentos que, utilizando los cinco sentidos, explican conceptos como la gravedad, la energía, la fuerza, la luz, etc. Experimentos tan divertidos como construir una pirámide dulce, o una casa para las abejas, o montando un pequeño paracaídas, etc.",
    "ISBNLibro": "978-84-683-4632-8",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T16:36:58.643601-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 18,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 49,
    "codigoLibro": "BM000046",
    "tituloLibro": "Tirar del hilo (Salvo Montalbano 29",
    "formatoLibro": "a",
    "resumenLibro": "En Tirar del hilo, Camilleri sacude nuestra conciencia poniendo el foco en uno de los dramas sociales más terribles e intensos de la actualidad europea: la crisis de la inmigración. Cuando Vigàta se llena de pateras, Salvo Montalbano se ve completamente desbordado de trabajo. Tras haber sobrevivido a las olas traicioneras, cientos de migrantes llegan hasta la costa en pésimas condiciones, sin medios ni garantías, por lo que ayudar se convierte en un deber para el comisario y sus hombres. Como si ese apremiante desastre no bastara, Montalbano, acuciado por Livia ante la inminencia de las bodas de plata de unos amigos, se pone en manos de Elena, una bella modista que regenta la sastrería más afamada de Vigàta y con la que traba una complicidad inmediata. Pero cuando Elena aparece brutalmente asesinada, entre algodones libaneses y rollos de tela, el comisario, con la colaboración nada menos que del gato de la víctima, hará todo lo posible para desenmarañar el ovillo de tan horrendo crimen. En Tirar del hilo, su libro número cien y el vigesimonoveno dedicado a Salvo Montalbano, Camilleri nos brinda una magnífica novela negra que pone el foco en la crisis migratoria, una de las tragedias más duras de la realidad europea actual, «una excusa estupenda para levantar viejas y nuevas fronteras con alambre de espino». Reseñas:«Camilleri sólo hay uno.»Antonio Manzini «Camilleri es un escritor de gran talento, amante de la dimensión más artesanal y menos pretenciosa de la literatura.»Roberto Cotroneo «Camilleri ocupa un lugar único en las letras italianas, tanto por la calidad de sus libros como por la excelente acogida del público.»Carlo Bo",
    "ISBNLibro": "978-84-9838-992-0",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T13:11:17.322326-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 8,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 50,
    "codigoLibro": "BM000047",
    "tituloLibro": "Marina",
    "formatoLibro": "a",
    "resumenLibro": "En la Barcelona de 1980 Óscar Drai sueña despierto, deslumbrado por los palacetes modernistas cercanos al internado en el que estudia. En una de sus escapadas conoce a Marina, que comparte con Óscar la aventura de adentrarse en un enigma doloroso del pasado de la ciudad. Un misterioso personaje de la posguerra se propuso el mayor desafío imaginable, pero su ambición lo arrastró por sendas siniestras cuyas consecuencias debe pagar alguien todavía hoy. «Quince años más tarde, la memoria de aquel día ha vuelto a mí. He visto a aquel muchacho vagando entre las brumas de la estación de Francia y el nombre de Marina se ha encendido de nuevo como una herida fresca. Todos tenemos un secreto encerrado bajo llave en el ático del alma. Éste es el mío.»",
    "ISBNLibro": "978-84-08-00434-9",
    "anioPublicacionLibro": 2012,
    "fechaCreacionLibro": "2020-07-08T13:17:44.042875-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 9,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 51,
    "codigoLibro": "BM00000",
    "tituloLibro": "Orient-Express",
    "formatoLibro": "e",
    "resumenLibro": "El Orient-Express fue durante décadas el símbolo de una Europa diversa llena de personajes variopintos, de olores, colores y sabores, unida por este tren que, más que un medio de transporte, fue una extraordinaria forma de civilización y de entendimiento entre los pueblos. Mauricio Wiesenthal, con su prosa envolvente y fragante, nos transporta a países y estaciones, narra sus historias y leyendas, y crea un relato vívido y evocador, a caballo entre las memorias y el ensayo. «La literatura del tren tiene que ser, por fuerza, impresionista y confusa. El tren nos da un destino, una distancia, un más allá sin trascendencia ni juicio final. Y eso hace más bellas y voluptuosas las historias que, como las noches del tren o las aventuras de amor, no tienen principio ni fin».",
    "ISBNLibro": "978-84-17902-32-2",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T13:24:27.575622-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 10,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 52,
    "codigoLibro": "BM000048",
    "tituloLibro": "Los Compas escapan de la prisión",
    "formatoLibro": "a",
    "resumenLibro": "Gracias al diamantito legendario, MIKE, TIMBA y TROLLI pueden continuar por fin con sus merecidas vacaciones… ¿O no? Justo cuando están celebrándolo, aparece el sargento Pimiento, al mando de la policía de Tropicubo, y los detiene por vandalismo. ¡Pero si ellos no han hecho nada! Por más que protestan, parece que la nueva aventura de los Compas tendrá lugar en un sitio que ninguno de ellos imaginaba…",
    "ISBNLibro": "978-84-270-4609-2",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-07-08T15:22:12.800385-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 11,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 53,
    "codigoLibro": "BM000049",
    "tituloLibro": "El enigma de la habitación 622",
    "formatoLibro": "a",
    "resumenLibro": "NÚMERO 1 EN VENTAS Vuelve el «principito de la literatura negra contemporánea, el niño mimado de la industria literaria» (GQ): el nuevo thriller de Joël Dicker es su novela más personal. MÁS DE 9.000.000 DE LECTORES SON #AdictosaDicker Ganador del Premio Goncourt des Lycéens, del Gran Premio de Novela de la Academia Francesa, del Premio Lire, del Premio Qué Leer y del Premio San Clemente Una noche de diciembre, un cadáver yace en el suelo de la habitación 622 del Palace de Verbier, un hotel de lujo en los Alpes suizos. La investigación policial no llegará nunca a término y el paso del tiempo hará que muchos olviden lo sucedido. Años más tarde, el escritor Joël Dicker llega a ese mismo hotel para recuperarse de una ruptura sentimental. No se imagina que terminará investigando el viejo crimen, y no lo hará solo: Scarlett, la bella huésped y aspirante a novelista de la habitación contigua, lo acompañará en la búsqueda mientras intenta aprender también las claves para escribir un buen libro. ¿Qué sucedió aquella noche en el Palace de Verbier? Es la gran pregunta de este thriller diabólico, construido con la precisión de un reloj suizo. Joël Dicker nos lleva finalmente a su país natal para narrarnos una investigación policial en la que se mezclan un triángulo amoroso, juegos de poder, traiciones y envidias en una Suiza no tan tranquila, donde la verdad es muy distinta a todo lo que hayamos imaginado. La crítica ha dicho...«Voluntad, secretos e intriga: el camino al éxito. El autor superventas lleva la trama de su nueva novela al ámbito financiero en Suiza y construye un thriller híbrido en el que juega con él mismo como personaje. Se pueden decir muchas cosas, y se han dicho, sobre Joël Dicker, pero no que no sepa lo que quiere, cómo conseguirlo y a quién se lo debe.»Juan Carlos Galindo, El País «Una vuelta de tuerca a la metaliteratura [...], con una estructura envidiable, retorcida, y un gran truco final.»Verónica García-Peña, El Comercio «La seducción del universo Dicker: [...] una atmósfera de misterio que atrapa a los lectores.»Lara Gómez Ruiz, La Vanguardia «Joël Dicker regresa en vísperas del verano con el que promete ser otro best seller, [...] una compleja arquitectura literaria a base de flashbacks, laberínticos interludios, equívocos argumentales y un suspense en la mejor tradición de Agatha Christie o el Mr. Ripley de Patricia Highsmith.»Vanessa Graell, El Mundo «Joël convierte en oro todo lo que toca o, mejor dicho, todo lo que escribe. [...] Con esta nueva novela vuelve a poner sobre la mesa su talento y su maestría.»Noelia Hontorio, Crónica Global - El Español «Cuando abres un libro de Joël Dicker, no puedes soltarlo. [...] El caballero de la literatura negra contemporánea, el escritor suizo de 35 años con pinta de modelo, regresa [...] Un adictivo homenaje al mundo de los libros. [...] El libro más esperado de la temporada.»Gema Veiga, Elle «La novela más impresionante que nos ha regalado Joël Dicker: [...] se devora.»Pierre Vavasseur, Le Parisien «El suizo que resucita las librerías.»Jesús Ruiz Mantilla, El País Semanal",
    "ISBNLibro": "978-84-204-3938-9",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T15:29:46.726592-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 12,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 54,
    "codigoLibro": "BM000051",
    "tituloLibro": "Ingeniería Una Historia Ilustrada desde la Artesanía Antigua a la Tecnología Moderna",
    "formatoLibro": "e",
    "resumenLibro": "La historia de la ingeniería es, en muchos aspectos, la historia de la civilización. Empieza en la Edad de Piedra, cuando la humanidad aprendía a fabricar herramientas con ese material, y continúa hoy en día cuando desarrollamos fuentes de energía renovable, transportes rápidos, edificios más grandes y más eficientes, e incluso creamos robots para realizar las tareas que son demasiado peligrosas y difíciles para nosotros.",
    "ISBNLibro": "978-84-662-3922-6",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-07-08T15:45:55.420653-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 13,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 55,
    "codigoLibro": "BM000052",
    "tituloLibro": "Ingeniería Temas Curiosos, Retos y Actividades para Convertirse en un gran Ingeniero",
    "formatoLibro": "a",
    "resumenLibro": "Stem es un divertido método que combina aprendizaje y juego desde una aplicación práctica basada en el entretenimiento, cuyo fin es encontrar la resolución a distintos retos dentro de estas cuatro áreas. La ingeniería desarrolla con sus conocimientos herramientas innovadoras en todos los ámbitos: mecánica, construcción, sanidad, aeroespacial, informática para mejorar nuestro día a día y que sigamos avanzando. Enfréntate a ella desde la pregunta y resuelve tú mismo las actividades que te proponemos en cada tema.",
    "ISBNLibro": "978-84-662-1976-1",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-07-08T15:56:12.97348-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 13,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 56,
    "codigoLibro": "BM000053",
    "tituloLibro": "Cómo estimular el cerebro del niño",
    "formatoLibro": "e",
    "resumenLibro": "El conocimiento de la estructura y función del cerebro que aporta la neurociencia está proporcionando, de un modo cada vez más acelerado, nuevos datos que impactan\r\nen muchos y diferentes campos de las humanidades. Campos que discurren desde la filosofía a la ética pasando por la estética o la economía o, más recientemente, la educación. Y, desde luego, este impacto se está produciendo, y de\r\nmodo destacado, en la psicología y el estudio de la conducta, de las que, a su vez, se nutren los conocimientos aportados por la propia neurociencia. Claramente estos conocimientos sobre el cerebro y su impacto en las humanidades transforman, cambian, la sociedad en que se vive, y son estos cambios los responsables últimos de la evolución constante y sucesiva de las culturas.",
    "ISBNLibro": "9788426728746",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T16:10:31.322307-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 1,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 57,
    "codigoLibro": "BM000054",
    "tituloLibro": "Ingeniería increíble 35 proyectos alucinantes para hacer en casa",
    "formatoLibro": "a",
    "resumenLibro": "¡Un robot que baila, un submarino hecho con una botella y un boombox para tu móvil son solo algunos de los 35 proyectos que contiene este libro! Prepárate para alucinar con la ingeniería estructural, mecánica y eléctrica. Experimenta en casa con toda clase de objetos cotidianos. Manipúlalos para darles nuevos e increíbles usos.",
    "ISBNLibro": "978-84-140-2531-4",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T16:18:35.695619-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 17,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 59,
    "codigoLibro": "BM000056",
    "tituloLibro": "INGENIERIA EN SEGUNDOS",
    "formatoLibro": "e",
    "resumenLibro": "Pensadores, teorías, descubrimientos y conceptos relacionados con la ingeniería explicados en una sola página de manera muy sencilla. ¡Lo comprenderá en segundos! Incluye conceptos de: ingeniería genética, sobre la radio, inventores como Bell, etc",
    "ISBNLibro": "978-94-6359-428-8",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T16:47:45.742929-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 19,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 65,
    "codigoLibro": "BM000064",
    "tituloLibro": "La tabla periódica de los elementos químicos",
    "formatoLibro": "e",
    "resumenLibro": "La tabla periódica es uno de los pilares esenciales en los que se apoyan la química y la ingeniería química, pero también lo hacen la arqueología, astronomía, biología, bioquímica, ciencia de materiales, ciencia medioambiental, física, geología, paleontología y todas las ingenierías. La tabla periódica es el icono de la ciencia y la tecnología y una de las imágenes más fácilmente reconocibles de nuestra civilización.",
    "ISBNLibro": "978-84-9097-660-9",
    "anioPublicacionLibro": 2019,
    "fechaCreacionLibro": "2020-07-08T17:33:17.885211-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 23,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 64,
    "codigoLibro": "BM000063",
    "tituloLibro": "Reversing, ingeniería inversa",
    "formatoLibro": "a",
    "resumenLibro": "La capacidad de invertir el proceso de compilado de un código fuente, siendo capaz de convertir un conjunto de números binarios en código fuente entendible por una persona con conocimientos de programación, sin más herramientas que la vista, es sin duda una gran cualidad que diferencia a los profesionales entre sí. El objetivo principal del libro es dotar al lector de las herramientas necesarias para poder llevar a cabo labores de ingeniería inversa por sus propios medios y comprendiendo en cada momento lo que sucede, sin toparse con barreras técnicas a las que no pueda enfrentarse. En esta obra el autor pone en práctica todo lo aprendido con casos reales y resueltos paso a paso, como la explotación de un fallo de seguridad, la detección de una puerta trasera y la generación de un fichero con formato válido habiendo proporcionado tan solo el binario que lo valida. También el lector encontrará un repaso por la historia de la ingeniería inversa, teoría de compiladores, estructuras de datos y de control (x86 32 y 64 bits y ARM), funcionamiento de los desensambladores y depuradores bajo Linux y Windows, formatos de ficheros PE y ELF, funcionamiento de cargadores dinámicos también en Linux y Windows El objetivo del libro sin duda, es proporcionar de recursos al lector para afrontar los diversos retos con una buena base teórica y técnica para",
    "ISBNLibro": "978-84-9964-706-7",
    "anioPublicacionLibro": 2017,
    "fechaCreacionLibro": "2020-07-08T17:24:40.7172-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 22,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 66,
    "codigoLibro": "BM000065",
    "tituloLibro": "El libro de la Ingeniería",
    "formatoLibro": "a",
    "resumenLibro": "Este libro es una exploración cronológica de 250 de los hitos más fascinantes de la historia de la ingeniría, desde el año 30 000 a.C. hasta nuestros días y con la mirada puesta en el futuro. Este recorrido por la historia aborda temas tan variados como el sistema de acueductos romano, la Gran Muralla china, la locomotora de vapor, el aire acondicionado, el canal de Panamá, la llegada del hombre a la luna, el coche híbrido Prius, el teléfono inteligente o la atracción del viaje prohibido de Harry Potter. Tras todos esos hitos encontramos a personajes clave, como Thomas Edison, Albert Einstein, Gottlieb Daimler, Mijaíl Kaláshnikov, Eero Saarinen y Steve Jobs. Con un entusiasmo contagioso, el autor presenta el fascinante mundo de la ingeniería y la enorme influencia que tiene en nuestra vida diaria.",
    "ISBNLibro": "978-90-8998-654-2",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-07-08T17:42:39.022157-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 24,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 68,
    "codigoLibro": "BM000067",
    "tituloLibro": "Ingeniería de procesos diseño e integración de procesos químicos",
    "formatoLibro": "a",
    "resumenLibro": "No Disponible",
    "ISBNLibro": "978-84-17946-20-3",
    "anioPublicacionLibro": 2020,
    "fechaCreacionLibro": "2020-07-08T18:04:12.241197-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 25,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 67,
    "codigoLibro": "BM000066",
    "tituloLibro": "Optimización de Algoritmos programados con MATLAB",
    "formatoLibro": "a",
    "resumenLibro": "Optimización. Algoritmos programados con MATLAB es un libro de texto para estudiantes y profesionales en las áreas de ciencias de la computación, inteligencia artificial, investigación de operaciones, matemáticas aplicadas y control de calidad. El principal objetivo de este libro es brindar una visión unificada de los métodos de cómputo evolutivo, de tal forma que se presentan los principios de diseño así como los operadores de los enfoques evolutivos fundamentales, además de que se considera su implementación por medio de la programación con MATLAB. El lector conocerá los conceptos necesarios para desarrollar y modificar los métodos de cómputo evolutivo con el fin de obtener los desempeños adecuados a las necesidades específicas de los problemas de optimización que normalmente surgen en varios nichos y proyectos industriales, entre otros ámbitos. Los diferentes algoritmos y métodos de cómputo evolutivo que presenta la optimización. El ciclo de cada algoritmo, así como su inicialización, cruza y mutación. Un enfoque amplio hacia la identificación de los pseudocódigos y los diagramas de flujo propios de cada algoritmo. Erik Valdemar Cuevas Jiménez. Es Ingeniero en Comunicaciones y Electrónica por parte de la Universidad de Guadalajara, Maestro en Electrónica Industrial por el ITESO y Doctor en Inteligencia Artificial por la Universidad Libre de Berlín (FUBerlín), en Alemania. Diego Alberto Oliva Navarro. Ingeniero en Electrónica y Computación por el Centro de Enseñanza Técnica Industrial y Maestro en Ciencias en Ingeniería Electrónica y Computación por el Centro Universitario de Ciencias Exactas e Ingenierías de la Universidad de Guadalajara, en México. Doctor en Ingeniería Informática por la Universidad Complutense de Madrid, en España. Margarita Arimatea Díaz Cortés. Recibió el grado en Ingeniera Biomédica en la Universidad de Guadalajara y el grado de Maestra en Ciencias de la Ingeniería Electrónica y Computación por la misma institución. Actualmente estudia el doctorado en Ciencias Computacionales en la Universidad Libre de Berlín. José Valentín Osuna Enciso. Estudió Ingeniería en Electrónica en el Instituto Tecnológico del Mar en Sinaloa, la Maestría en Ciencias en Ingeniería Electrónica y Computación en el Centro Universitario de Ciencias Exactas e Ingenierías de la Universidad de Guadalajara, y el Doctorado en Ciencias de la Computación por el Centro de Investigación en Computación del Instituto Politécnico Nacional.",
    "ISBNLibro": "978-84-267-2411-3",
    "anioPublicacionLibro": 2016,
    "fechaCreacionLibro": "2020-07-08T17:47:41.3321-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 1,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 76,
    "codigoLibro": "BM000076",
    "tituloLibro": "Introducción a la Ingeniería",
    "formatoLibro": "a",
    "resumenLibro": "Introducción a la ingeniería es una obra dirigida a los estudiantes de todas las áreas de la ingeniería en la que se expone una introducción acerca del origen de la misma, se analizan las diferencias y correspondencias entre ciencia, tecnología e ingeniería y se describen las competencias esenciales de un ingeniero y sus características en diferentes organizaciones profesionales. Asimismo se presentan las diferentes especialidades de la ingeniería además de las diferentes líneas de investigación actuales, su prospectiva hacia el medio ambiente y finalmente la metodología para la elaboración de un proyecto de investigación en ingeniería. David Moises Terán Perez es ingeniero mecánico electricista egresado de la Universidad Nacional Autónoma de Mexico (UNAM), con especialidad en habilidades docentes por la Universidad Tecnológica de Mexico (UNITEC). Cursó la Maestría en Ciencias de la Educación en la Universidad del Valle de Mexico (UVM), el Doctorado en Educación en la Universidad Pedagógica Nacional (UPN) y realizó una estancia postdoctoral auspiciada por el Consejo Nacional de Ciencia y Tecnología (CONACyT) en la Universidad Autónoma del Estado de Hidalgo (UAEH).",
    "ISBNLibro": "978-84-267-2357-4",
    "anioPublicacionLibro": 2016,
    "fechaCreacionLibro": "2020-07-08T19:23:59.335268-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 1,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 69,
    "codigoLibro": "BM000068",
    "tituloLibro": "Introducción a la Ingeniería Industrial",
    "formatoLibro": "a",
    "resumenLibro": "Introducción a la Ingeniería Industrial. Contexto Occidental es un libro de texto para los cursos de esta materia, que se imparten en los primeros semestres de la carrera de Ingeniería Industrial. En esta obra se presenta la evolución de la Ingeniería Industrial identificándose cinco etapas básicas: orígenes e ingenierías precursoras; Ingeniería Industrial convencional asociada a los estudios de movimientos y tiempos; Ingeniería Industrial apoyada en modelos de investigación de operaciones; Ingeniería Industrial basada en sistemas; Ingeniería Industrial fundamentada en las teorías de sistemas, decisiones, comunicación e información. Aprenda a evaluar las técnicas de Ingeniería Industrial, como un producto de la actividad, cultura y contexto occidental. Conozca la evolución de la Ingeniería Industrial en el contexto occidental. Desarrolle una visión básica de la aplicación, alcance, funciones e importancia de la Ingeniería Industrial. José Fidencio Domingo González Zúñiga es Ingeniero Mecánico Electricista por la Facultad de Ingeniería de la UNAM, y obtuvo el grado de Maestro en Ciencias y la Especialización en Ingeniería Industrial en la UPIICSA del IPN. Ha obtenido los diplomados en Enseñanza Superior (ENEP, UNAM), en Formación de Instructores (EDUMAC, IPN), en Metodología de Diagnóstico Empresarial Institucional (NAFINSA), así como la certificación Basic Most Applicator (H.B. MAYNARD AND COMPANY).",
    "ISBNLibro": "978-84-267-2252-2",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-07-08T18:18:37.745776-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 1,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 70,
    "codigoLibro": "BM000069",
    "tituloLibro": "Ingeniería estructural Cálculo plástico, dinámico y sísmico de estructuras",
    "formatoLibro": "a",
    "resumenLibro": "En las escuelas de ingeniería la mayor parte de los temarios en las distintas asignaturas relacionadas con el análisis estructural, están basados exclusivamente en el análisis estructural ante cargas estáticas y en el com-portamiento lineal de los materiales, según la teoría clásica de resistencia de materiales. Sin embargo, cada vez tienen una mayor presencia en los proyectos ingenieriles otros tipos de análisis estructural como son el cálculo plástico, es decir, no dar como válida la hipótesis de comportamiento elástico de los cuerpos y el cálcu-lo dinámico, donde se estudia el análisis estructural ante cargas que son variables en un corto espacio de tiempo. Estos dos tipos de análisis estructural permiten, abordar una introducción a la ingeniería sísmica pues el cálculo plástico está presente, a través del concepto de ductilidad de una estructura, en cualquier diseño es-tructural sísmico y obviamente, los movimientos del suelo son un tipo de carga dinámica. También permite abordar el estudio de las distintas normativas de construcción sismoresistente con la que poder diseñar y cal-cular estructuras situa",
    "ISBNLibro": "978-84-16228-88-1",
    "anioPublicacionLibro": 2018,
    "fechaCreacionLibro": "2020-07-08T18:27:30.224689-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 26,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 71,
    "codigoLibro": "BM000070",
    "tituloLibro": "Ingeniería fluidomecánica",
    "formatoLibro": "a",
    "resumenLibro": "El objetivo del presente libro es dar respuesta a las nuevas necesidades docentes relativas a la enseñanza de la Mecánica de Fluidos en los nuevos planes de estudio de Graduado en Ingeniería, donde esta disciplina se imparte, en muchos casos, en el segundo curso. Los conocimientos que se requieren para abordar el estudio de este texto son los que debería tener un alumno de segundo curso de Graduado en Ingeniería. Así, se presupone una serie de conocimientos básicos sobre Mecánica y Termodinámica adquiridos en las asignaturas de primer curso, mientras que los conocimientos matemáticos necesarios para seguir el curso son los esperables tras estudiar las asignaturas típicas de Cálculo y Álgebra, también de primer curso.",
    "ISBNLibro": "978-84-9732-904-0",
    "anioPublicacionLibro": 2012,
    "fechaCreacionLibro": "2020-07-08T18:37:59.337295-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 27,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 72,
    "codigoLibro": "BM000071",
    "tituloLibro": "Ingeniería de Sonido. Conceptos, fundamentos y casos prácticos",
    "formatoLibro": "e",
    "resumenLibro": "El mundo de la ingeniería en el sonido es algo que puede resultar bastante complejo y confuso, ya que abarca amplias áreas y aspectos técnicos. Obviamente y dejando aparte los pasos más mecánicos y rudimentarios, realmente no existe ninguna metodología e",
    "ISBNLibro": "978-84-9964-743-2",
    "anioPublicacionLibro": 2018,
    "fechaCreacionLibro": "2020-07-08T18:43:41.615867-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 22,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 73,
    "codigoLibro": "BM000072",
    "tituloLibro": "Modelos aleatorios en Ingeniería",
    "formatoLibro": "e",
    "resumenLibro": "El azar está presente en buena parte de los problemas a que debe enfrentarse un ingeniero en su vida profesional. En el campo de las telecomunicaciones, por ejemplo, fenómenos como la aparición de ruido en un canal de transmisión o el acceso de usuarios a un determinado servicio de red a lo largo del tiempo no pueden ser modelizados de forma determinista, debido a la alta complejidad de los sistemas involucrados.;Este libro proporciona una panorámica general de los principales problemas tratados por la Teoría de la Probabilidad y sus aplicaciones en la ingeniería. Se parte de los modelos más sencillos, las variables aleatorias, y se va profundizando hasta plantear otros de mayor complejidad, como los procesos aleatorios de Poisson y Wiener (movimiento browniano), las cadenas de Markov o los modelos exponenciales usados en Teoría de Colas.;El libro está dirigido a estudiantes de los distintos grados de ingeniería, informática y ciencias en general.;Los autores, Angel Blasco y Sonia Pérez-Díaz, son ambos doctores en Matemáticas y profesores titulares en la Universidad de Alcalá de Henares. Uno y otro han impartido, durante más de una década, distintas asignaturas de estadística en esta Universidad, y en particular en la correspondiente Escuela Politécnica Superior.;Cada capítulo tiene una apartado de PROBLEMAS PROPUESTOS, cuyas SOLUCIONES pueden encontrarse junto con la información detallada del libro en www.paraninfo.es",
    "ISBNLibro": "978-84-283-3723-6",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-07-08T19:00:27.126939-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 27,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 74,
    "codigoLibro": "BM000075",
    "tituloLibro": "100 Problemas resueltos de programación en lenguaje C para ingeniería",
    "formatoLibro": "a",
    "resumenLibro": "Las (mal llamadas) clases de problemas constituyen una herramienta fundamental en cualquier disciplina científica. Tradicionalmente, estas clases cumplen el objetivo de complementar aspectos más o menos difíciles de la disciplina en cuestión. Sin embargo, deberían entenderse más como un entrenamiento que capacite al estudiante para resolver cualquier problema (en sentido amplio) que se le pueda plantear en su vida profesional. Con este espíritu se concibe esta colección de Problemas resueltos que Ediciones Paraninfo pone a disposición de profesores;y estudiantes de una gran variedad de disciplinas académicas.;Este libro contiene ejercicios de programación resueltos en lenguaje C. El principal objetivo de esta obra es conseguir que el lector adquiera y afiance sus conocimientos sobre la metodología de la programación estructurada mediante ejercicios guiados de complejidad variable. Además, los primeros capítulos presentan también los algoritmos expresados en diagrama de flujo, para hacer más accesible el procedimiento adoptado.;Se hace un recorrido de contenidos de complejidad creciente, se comienza con las estructuras de control básicas (secuencial, iterativa y bifurcaciones), para continuar con las estructuras básicas de datos estáticas, como son los vectores y matrices. Seguidamente se presentan los bloques funcionales de programación, funciones en C, registros, gestión de memoria dinámica, listas enlazadas y ficheros.;Esta obra proporciona a los lectores material adicional de estudio, así como un enfoque práctico de la programación, ilustrando los distintos conceptos y recursos con ejercicios resueltos.;Ignacio Alvarado Aldea es doctor ingeniero industrial por la Universidad de Sevilla y profesor del Departamento de Ingeniería de Sistemas de la Universidad de Sevilla.;José María Maestre Torreblanca es doctor ingeniero en Telecomunicación y profesor del Departamento de Ingeniería de Sistemas y Automática de la Universidad de Sevilla.;Carlos Vivas Venegas es doctor ingeniero industrial por la Universidad de Sevilla y profesor del Departamento de Ingeniería de Sistemas de la Universidad de Sevilla.;Ascensión Zafra Cabeza es doctora ingeniera en Informática por la Universidad de Sevilla y profesora titular de Ingeniería de Sistemas y Automática en la Universidad de Sevilla.",
    "ISBNLibro": "978-84-283-3969-8",
    "anioPublicacionLibro": 2017,
    "fechaCreacionLibro": "2020-07-08T19:11:38.81918-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 27,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 75,
    "codigoLibro": "BM00000",
    "tituloLibro": "Ingeniería de bioprocesos",
    "formatoLibro": "e",
    "resumenLibro": "A partir de un análisis de los procesos industriales de base biológica, y de principios básicos ingenieriles y biológicos, se tratan las biotransformaciones y las herramientas físicas de transporte y separación, desde la selección de productos, la preparación de materiales hasta el empaquetado, y los aspectos económicos y legales.;Pretende ser un libro de referencia para estudiantes de Biotecnología, de Ingeniería Química, de Bioprocesos, así como de especialidades de Ingeniería de Alimentos, Farmacia, etc. Esperamos también que sea un libro de consulta general para otras ingenierías y ciencias aplicadas.",
    "ISBNLibro": "978-84-283-8123-9",
    "anioPublicacionLibro": 2012,
    "fechaCreacionLibro": "2020-07-08T19:16:28.864776-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 27,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 77,
    "codigoLibro": "BM000077",
    "tituloLibro": "Diseño y cálculo de intercambiadores de calor monofásicos",
    "formatoLibro": "e",
    "resumenLibro": "Esta obra, fruto de varios años de trabajo de investigación y estudio, no es únicamente un libro teórico, sino más bien una guía práctica, exhaustiva y relativamente sencilla para el cálculo de los parámetros de diseño que definen a un intercambiador de calor monofásico.;El texto está dirigido a estudiantes de ingeniería y diseñadores de intercambiadores de calor, empresas, talleres, laboratorios que necesitan implementar (diseñar y construir) un intercambiador de calor en sus equipos, sistemas y líneas de trabajo.;Se trata de una obra única que recopila los conocimientos necesarios y pasos prácticos clave para poder diseñar la mayoría de los intercambiadores de calor monofásicos existentes. Para ello, se presuponen los conocimientos básicos de transferencia de calor que se pueden adquirir con cualquier libro de texto de la materia.;El primer capítulo del libro presenta los aspectos generales de los intercambiadores de calor, una introducción al procedimiento de cálculo, los criterios de selección del tipo de intercambiador y el algoritmo general de diseño fluidotérmico de un intercambiador de calor.;El segundo capítulo está dedicado a los intercambiadores de carcasa y tubos, cuyo uso es el más extendido en aplicaciones industriales. Los capítulos tercero y cuarto se centran en los intercambiadores compactos, el tercero en los tubulares y el cuarto en los de placas. Finalmente, el capitulo seis recopila numerosos casos de aplicación.;José Mª Marín Herrero, Licenciado en Física y Doctor en Ciencias por la Universidad de Zaragoza, actualmente es profesor titular del Departamento de Ingeniería Mecánica, Área de Máquinas y Motores Térmicos de la Universidad de Zaragoza en la Escuela de Ingeniería y Arquitectura (EINA).;Silvia Guillén Lambea, Ingeniera Superior Industrial por la Universidad de Zaragoza e Ingeniera Mecánica por la Universidad de Compiègne (Francia), actualmente compagina su actividad investigadora en la universidad de Zaragoza, en el Área de Máquinas y Motores Térmicos del departamento de Ingeniería Mecánica con su actividad profesional como directora de proyectos en la empresa privada.",
    "ISBNLibro": "978-84-283-0438-2",
    "anioPublicacionLibro": 2013,
    "fechaCreacionLibro": "2020-07-08T19:35:12.368417-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 27,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 78,
    "codigoLibro": "BM000078",
    "tituloLibro": "INGENIERÍA DE CONTROL MODERNA",
    "formatoLibro": "a",
    "resumenLibro": "Esta nueva edición presenta un tratamiento riguroso y completo del análisis y diseño de sistemas de control. Los lectores encontrarán, en esta nueva edición del ya clásico libro de Ogata, un texto claro y comprensible escrito para estudiantes de ingeniería mecánica, eléctrica, aeroespacial o química, con numerosos ejemplos de todos estos campos. En esta quinta edición se ha ampliado la utilización de MATLAB para obtener la respuesta de sistemas de control a diferentes entradas. Otra novedad es la inclusión de nuevos problemas como ejemplos, que facilitan el aprendizaje y el seguimiento de los conceptos introducidos. Las mejoras de esta nueva edición son: Se ha ampliado la utilización de MATLAB para obtener la respuesta de sistemas de control a diferentes entradas. Se demuestra la utilidad del enfoque de optimización computacional con MATLBAB. A lo largo de todo el libro se han añadido nuevos problemas como ejemplos. Con el fin de proporcionar espacio a temas más importantes, se han suprimido ciertos materiales de ediciones previas que tienen una importancia secundaria. Los grafos de flujo de señal se han eliminado del libro. También se suprimió un capítulo sobre la transformada de Laplace y el desarrollo en fracciones simples con MATLAB en los apéndices A y B respectivamente. En el apéndice C se da un corto resumen sobre el análisis vectorial matricial. Si este libro se usa como texto para un curso semestral se puede cubrir la mayor parte del material omitiendo ciertas partes.",
    "ISBNLibro": "978-84-8322-660-5",
    "anioPublicacionLibro": 2010,
    "fechaCreacionLibro": "2020-07-08T19:38:20.770554-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 5,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  },
  {
    "idLibro": 79,
    "codigoLibro": "BM000079",
    "tituloLibro": "Ingeniería de la exportación La ruta para internacionalizar su empresa",
    "formatoLibro": "a",
    "resumenLibro": "Se trata de una obra pensada, estructurada y claramente concebida, tanto para el lector nobel como para el consultor algo más experto, dirigida no solo a aprender sobre exportación, sino también a \"\"crear\"\" su propio proyecto de exportación. Es, una guía novedosa y completa, escrita con un estilo ameno y práctico que cuenta qué hacer, qué no hacer y cómo hacer en la gestión de la exportación e internacionalización. Contiene 102 check-list que fijan, de forma práctica y sintética, los conceptos abordados y representan, al mismo tiempo, un recordatorio para realizar las más variadas actividades en la gestión cotidiana del comercio exterior. Además, expone el método \"\"export check-up\"\", un test constituido por 60 preguntas para su autoevaluación. Cuenta con un valor añadido muy actual y útil: incluye una herramienta indispensable para los profesores, consultores, funcionarios, El lector tendrá acceso online a un archivo en el que se incluyen: copia de todos los check-list, los más de 600 links que aparecen en el libro, copia de todos los check-up, presentación en power point, multitud de preguntas de cada parte del libro, además de 100 preguntas formuladas y, ejercicios referentes a cada capítulo.",
    "ISBNLibro": "978-84-15781-62-2",
    "anioPublicacionLibro": 2015,
    "fechaCreacionLibro": "2020-07-08T19:46:25.331436-05:00",
    "estadoLibro": true,
    "bibliotecario_Libro_id": 1,
    "editorial_Libro_id": 28,
    "idiomaLibro_id": 149,
    "pais_Libro_id": 66
  }
]
